benchmarks/cospec_benchmark_results_20250524_021757_facebook/opt-6.7b_facebook/opt-125m_tp1_dtp1/colocation_selective_7_0_10_sharegpt_output.txt
INFO 05-24 04:47:39 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=10.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Temperature:  0.0
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     2241      
Benchmark duration (s):                  300.23    
Total input tokens:                      518177    
Total generated tokens:                  498516    
Request throughput (req/s):              7.46      
Output token throughput (tok/s):         1660.47   
Total Token throughput (tok/s):          3386.43   
---------------Time to First Token----------------
Mean TTFT (ms):                          19620.92  
Median TTFT (ms):                        18435.05  
P99 TTFT (ms):                           52646.66  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          109.49    
Median TPOT (ms):                        83.81     
P99 TPOT (ms):                           343.05    
---------------Inter-token Latency----------------
Mean ITL (ms):                           369.67    
Median ITL (ms):                         345.69    
P99 ITL (ms):                            773.26    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          35407.00  
Median E2EL (ms):                        33162.44  
P99 E2EL (ms):                           86483.88  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 696.10    
Median Token Latency (ms):               192.95    
P99 Token Latency (ms):                  6453.82   
==================================================