benchmarks/cospec_benchmark_results_20250524_021757_facebook/opt-6.7b_facebook/opt-125m_tp1_dtp1/colocation_selective_consolidated_7_0_2_opencode_output.txt
INFO 05-24 06:28:51 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='opencode', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=2.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 5000 samples from cache from nvidia/cache/open_code_instruct_facebook/opt-6.7b.json
Temperature:  0.0
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     588       
Benchmark duration (s):                  302.94    
Total input tokens:                      176758    
Total generated tokens:                  258135    
Request throughput (req/s):              1.94      
Output token throughput (tok/s):         852.09    
Total Token throughput (tok/s):          1435.56   
---------------Time to First Token----------------
Mean TTFT (ms):                          175.07    
Median TTFT (ms):                        172.65    
P99 TTFT (ms):                           285.41    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          15.13     
Median TPOT (ms):                        14.94     
P99 TPOT (ms):                           26.11     
---------------Inter-token Latency----------------
Mean ITL (ms):                           81.64     
Median ITL (ms):                         78.10     
P99 ITL (ms):                            155.95    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          6670.34   
Median E2EL (ms):                        5901.66   
P99 E2EL (ms):                           20613.01  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 15.58     
Median Token Latency (ms):               15.31     
P99 Token Latency (ms):                  26.65     
==================================================